# Integrating SQL and Python

## Step 1: Install the Required Libraries

In [1]:
!pip install pymysql

Collecting pymysql
  Obtaining dependency information for pymysql from https://files.pythonhosted.org/packages/0c/94/e4181a1f6286f545507528c78016e00065ea913276888db2262507693ce5/PyMySQL-1.1.1-py3-none-any.whl.metadata
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/45.0 kB ? eta -:--:--
   --------- ------------------------------ 10.2/45.0 kB ? eta -:--:--
   --------- ------------------------------ 10.2/45.0 kB ? eta -:--:--
   ------------------------------------ --- 41.0/45.0 kB 279.3 kB/s eta 0:00:01
   ---------------------------------------- 45.0/45.0 kB 222.6 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

## Step 2: Import Libraries and Connect to MySQL

In [1]:
import pymysql
import pandas as pd

# Connect to MySQL database
connection = pymysql.connect(
    host='localhost',  # Replace with your host
    user='root',  # Replace with your username
    password='2005',  # Replace with your password
    database='datascience'  # Replace with your database name
)

cursor = connection.cursor()

## Step 3: Execute Queries and Fetch Data

In [2]:
# Select all records from the employees table
select_query = """SELECT employee_id, first_name, last_name, email, department_id,salary
FROM employees """
cursor.execute(select_query)
rows = cursor.fetchall()

# Convert to a DataFrame for better readability
df = pd.DataFrame(rows, columns=['employee_id', 'first_name', 'last_name', 'email', 'department_id', 'salary'])

In [3]:
df.head()

,employee_id,first_name,last_name,email,department_id,salary
0,1,John,Doe,john.doe@example.com,10,60000.0
1,2,Jane,Smith,jane.smith@example.com,20,75000.0
2,3,David,Lee,david.lee@example.com,10,55000.0
3,4,Sarah,Jones,sarah.jones@example.com,30,80000.0
4,5,Michael,Brown,michael.brown@example.com,20,65000.0

## Step 4: Automate ETL Processes
* Here's a simple ETL (Extract, Transform, Load) example:

    * Extract data from the database
    * Transform the data (e.g., increase salaries by 10%)
    * Load the data back into the database (update salaries)

In [4]:
# Extract data
extract_query = 'SELECT employee_id, salary FROM employees'
cursor.execute(extract_query)
employees = cursor.fetchall()

# Transform data (increase salary by 10%)
updated_salaries = [(salary * 1.10, emp_id) for emp_id, salary in employees]

# Load data (update salaries in the database)
update_query = 'UPDATE employees SET salary = %s WHERE employee_id = %s'
cursor.executemany(update_query, updated_salaries)

# Commit the changes
#connection.commit()

# Verify the update
cursor.execute(select_query)
rows = cursor.fetchall()

# Convert to a DataFrame for better readability
df = pd.DataFrame(rows, columns=['employee_id', 'first_name', 'last_name', 'email', 'department_id', 'salary'])

In [5]:
df.head()

,employee_id,first_name,last_name,email,department_id,salary
0,1,John,Doe,john.doe@example.com,10,66000.0
1,2,Jane,Smith,jane.smith@example.com,20,82500.0
2,3,David,Lee,david.lee@example.com,10,60500.0
3,4,Sarah,Jones,sarah.jones@example.com,30,88000.0
4,5,Michael,Brown,michael.brown@example.com,20,71500.0